const benefitsData: {
	title: string;
	description: string;
	button: { name: string; icon: string };
}[] = [
	{
		title: "Местоположение",
		description:
			"Мы расположены в одном из самых живописных мест города — на берегу реки, это ваш оазис в черте города, куда можно сбежать от шумного и пыльного мегаполиса. Мы, действительно уникальные, ведь все продумано до мелочей: проект построен из дикого закарпатского сруба, камин в основном зале ресторана и панорамные окна с видом на реку, уютные беседки на берегу реки и лучшая видовая террасса, шатер с посадкой на 200 человек, сказочный детский домик и бассейн.",
		button: {
			name: "Свежайшие продукты",
			icon: "onion",
		},
	},
	{
		title: "Быстрая доставка",
		description:
			"Мы дорожим нашими клиентами, поэтому специально для вас работает профессиональная курьерская служба, которая доставит любые продукты из нашего сайта, которые вы пожелаете. Наши повара приготовят их, а курьеры доставят блюдо к вашему дому, пока оно не остыло",
		button: {
			name: "Быстрая доставка",
			icon: "flash",
		},
	},
	{
		title: "Наши повара",
		description:
			"Такие специалисты нарасхват в любое время, в том числе и сегодня. Они умеют готовить абсолютно все виды блюд, знают тонкости и секреты приготовления сложных яств, в частности паштетов, муссов, тортов, цельных молодых поросят и профитролей с различными начинками",
		button: {
			name: "Лучшие повара",
			icon: "chef",
		},
	},
	{
		title: "Высокая кухня",
		description:
			"До 1970-х годов «Высокая кухня» определялась традицией классической французской кухни, оформленной Огюстом Эскофье. В настоящее время высокую кухню не определяет какой-то особый стиль. Он может только быть описан, например, как фьюжн-кухня или молекулярная кухня, или региональная кухня. Известное издание «Красный гид Мишлен» проводит свою классификацию ресторанных заведений по качеству их работы, выявляет лучшие и зачисляет их в категорию «Рестораны высшего разряда».",
		button: {
			name: "Высокая кухня",
			icon: "onion",
		},
	},
];

export default benefitsData;

