const data: {
	question: {
		title: string;
		subtitle: string;
	}
}[] = [
	{
		question: {
			title: "У наших курьеров всегда должна быть сдача!",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие-либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
	{
		question: {
			title: "Вам что-то не довезли?",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие-либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
	{
		question: {
			title: "Не понравился продукт?",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие-либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
	{
		question: {
			title: "Если появились замечания",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие- либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
	{
		question: {
			title: "Оплата Visa, MasterCard и МИР",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие-либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
	{
		question: {
			title: "Реквизиты",
			subtitle: "Мы очень внимательно следим за качеством нашей работы, поэтому, если у вас будут какие-либо замечания или предложения, то обязательно сообщайте их нам",
		}
	},
]

export default data;